Yourcomputermaster/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЕжемесячнойАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Yourcomputermaster/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>АбонентскаяПлата</name>
  </enumValues>
</mdclass:Enum>

Yourcomputermaster/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Видимость = ВидДоговораПриИзмененииНаСервере(Объект.ВидДоговора);	
	Элементы.ГруппаДанныеДоговора.Видимость = Видимость;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскаяПлата Тогда
		ПроверяемыеРеквизиты.Добавить("ДействуетДо");
		ПроверяемыеРеквизиты.Добавить("СтавкаЧас");
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Видимость = ВидДоговораПриИзмененииНаСервере(Объект.ВидДоговора);
	
	Элементы.ГруппаДанныеДоговора.Видимость = Видимость;
	Объект.Дата = ОбщегоНазначенияКлиент.ДатаСеанса();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВидДоговора
&НаСервере
Функция ВидДоговораПриИзмененииНаСервере(ВидДоговора)
		
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскаяПлата Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
